# GetMacroManager Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MacroManager..::..GetMacroManager Method
MacroManager Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetMacroManager(Application) | Gets the Macro manager from the application. |
| GetMacroManager(Document) | Gets the Macro manager from the document. |

# See Also
MacroManager Class
MacroManager Members
Autodesk.Revit.DB.Macros Namespace